posts/javascript-basic/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>javascript basic | Andro's Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://youxincao.github.io/blog/posts/javascript-basic/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Andro Wei">
<link rel="prev" href="../welcome-to-nikola/" title="Welcome to Nikola" type="text/html">
<link rel="next" href="../mockito-varargs/" title="mockito varargs" type="text/html">
<meta property="og:site_name" content="Andro's Blog">
<meta property="og:title" content="javascript basic">
<meta property="og:url" content="http://youxincao.github.io/blog/posts/javascript-basic/">
<meta property="og:description" content="类型转换String -&gt; num, And num -&gt; String

var a = &quot;42&quot;;
var b = Number(a);
var c = String(b);

console.log(a);
console.log(b);
console.log(c);







JavaScript Scope


JavaScaript '{}' do not create scop">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-01-19T16:18:39+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://youxincao.github.io/blog/">

                <span id="blog-title">Andro's Blog</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">文章存档</a>
                </li>
<li>
<a href="../../categories/">标签</a>
                </li>
<li>
<a href="../../rss.xml">RSS 源</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">源代码</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">javascript basic</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../../authors/andro-wei/">Andro Wei</a>
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-01-19T16:18:39+08:00" itemprop="datePublished" title="2018-01-19 16:18">2018-01-19 16:18</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">源代码</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">类型转换String -&gt; num, And num -&gt; String</h2>
<div class="outline-text-2" id="text-1">
<div class="highlight"><pre><span></span><span class="kd">var</span> <span class="nx">a</span> <span class="o">=</span> <span class="s2">"42"</span><span class="p">;</span>
<span class="kd">var</span> <span class="nx">b</span> <span class="o">=</span> <span class="nb">Number</span><span class="p">(</span><span class="nx">a</span><span class="p">);</span>
<span class="kd">var</span> <span class="nx">c</span> <span class="o">=</span> <span class="nb">String</span><span class="p">(</span><span class="nx">b</span><span class="p">);</span>

<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">a</span><span class="p">);</span>
<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">b</span><span class="p">);</span>
<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">c</span><span class="p">);</span>
</pre></div>

<!-- TEASER_END -->
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">JavaScript Scope</h2>
<div class="outline-text-2" id="text-2">
<p>
JavaScaript '{}' do not create scope. The variable define in an scope can not access out the scope.
The function will create score, the inner score can access the variable define in outside scope.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">JavaScript built-in types</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>string 
</li>
<li>boolean 
</li>
<li>number
</li>
<li>null and undefined
</li>
<li>object
</li>
<li>symbol
</li>
</ul>
<p>
You can use method "typeof" get the type of an variable.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Immediately Invoked Function Expressions (IIFEs)</h2>
<div class="outline-text-2" id="text-4">
<div class="highlight"><pre><span></span><span class="p">(</span><span class="kd">function</span> <span class="nx">IIFE</span><span class="p">(){</span>
    <span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span> <span class="s2">"Hello!"</span> <span class="p">);</span>
<span class="p">})();</span>
</pre></div>


<div class="highlight"><pre><span></span><span class="kd">var</span> <span class="nx">a</span> <span class="o">=</span> <span class="mi">42</span><span class="p">;</span>

<span class="p">(</span><span class="kd">function</span> <span class="nx">IIFE</span><span class="p">(){</span>
    <span class="kd">var</span> <span class="nx">a</span> <span class="o">=</span> <span class="mi">10</span><span class="p">;</span>
    <span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span> <span class="nx">a</span> <span class="p">);</span> <span class="c1">// 10</span>
<span class="p">})();</span>

<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span> <span class="nx">a</span> <span class="p">);</span> <span class="c1">// 42</span>
</pre></div>

<p>
IIFE in this fashion is often used to declare variables that won’t affect the surrounding code outside the IIFE:
</p>

<div class="highlight"><pre><span></span><span class="kd">var</span> <span class="nx">x</span> <span class="o">=</span> <span class="p">(</span><span class="kd">function</span> <span class="nx">IIFE</span><span class="p">(){</span> <span class="k">return</span> <span class="mi">42</span><span class="p">;</span> <span class="p">})();</span> <span class="nx">x</span><span class="p">;</span> <span class="c1">// 42</span>
</pre></div>
<p>
The 42 value gets returned from the IIFE-named function being executed, and is then assigned to x.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Clojure</h2>
<div class="outline-text-2" id="text-5">
<p>
Clojure is a way to "remember" and continue to access a function's scope(it's scope),
even once the function has finish running.
</p>

<div class="highlight"><pre><span></span><span class="kd">function</span> <span class="nx">makeAdder</span><span class="p">(</span><span class="nx">x</span><span class="p">){</span>
    <span class="kd">function</span> <span class="nx">add</span><span class="p">(</span><span class="nx">y</span><span class="p">){</span>
	<span class="k">return</span> <span class="nx">y</span> <span class="o">+</span> <span class="nx">x</span><span class="p">;</span>
    <span class="p">}</span>
    <span class="k">return</span> <span class="nx">add</span><span class="p">;</span>
<span class="p">}</span>

<span class="kd">var</span> <span class="nx">plusOne</span> <span class="o">=</span> <span class="nx">makeAdder</span><span class="p">(</span><span class="mi">1</span><span class="p">);</span>
<span class="kd">var</span> <span class="nx">plusTen</span> <span class="o">=</span> <span class="nx">makeAdder</span><span class="p">(</span><span class="mi">10</span><span class="p">);</span>

<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">plusOne</span><span class="p">(</span><span class="mi">3</span><span class="p">));</span> <span class="c1">// 4</span>
<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">plusOne</span><span class="p">(</span><span class="mi">41</span><span class="p">));</span> <span class="c1">// 42</span>

<span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">plusTen</span><span class="p">(</span><span class="mi">2</span><span class="p">));</span> <span class="c1">// 12</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Module</h2>
<div class="outline-text-2" id="text-6">
<p>
Modules let you define private implementation details (variable, functions) that 
are hidden fomr the outside world, as well as a public API that is accessible from the outside.
</p>

<div class="highlight"><pre><span></span><span class="kd">function</span> <span class="nx">User</span><span class="p">(){</span>
    <span class="kd">var</span> <span class="nx">username</span><span class="p">,</span> <span class="nx">password</span><span class="p">;</span>

    <span class="kd">function</span> <span class="nx">doLogin</span><span class="p">(</span><span class="nx">user</span><span class="p">,</span><span class="nx">pw</span><span class="p">){</span>
	<span class="nx">username</span> <span class="o">=</span> <span class="nx">user</span><span class="p">;</span>
	<span class="nx">password</span> <span class="o">=</span> <span class="nx">pw</span><span class="p">;</span>
    <span class="p">}</span>

    <span class="kd">var</span> <span class="nx">publicAPI</span> <span class="o">=</span> <span class="p">{</span>
	<span class="nx">login</span><span class="o">:</span> <span class="nx">doLogin</span>
    <span class="p">};</span>

    <span class="k">return</span> <span class="nx">publicAPI</span><span class="p">;</span>
<span class="p">}</span>

<span class="kd">var</span> <span class="nx">user</span> <span class="o">=</span> <span class="nx">User</span><span class="p">();</span>
<span class="nx">user</span><span class="p">.</span><span class="nx">login</span><span class="p">(</span><span class="s2">"fred"</span><span class="p">,</span> <span class="s2">"1234"</span><span class="p">);</span>
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../welcome-to-nikola/" rel="prev" title="Welcome to Nikola">前一篇</a>
            </li>
            <li class="next">
                <a href="../mockito-varargs/" rel="next" title="mockito varargs">后一篇</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:lun.wei@outlook.com">Andro Wei</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script src="../../assets/js/colorbox-i18n/jquery.colorbox-zh-CN.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
